Autodesk.Revit.Attributes.RegenerationAttribute.Option
Regeneration option.
Since: 2011

Autodesk.Revit.Attributes.RegenerationAttribute.#ctor(Autodesk.Revit.Attributes.RegenerationOption)
Constructs a new RegenerationAttribute.
Since: 2011

Autodesk.Revit.Attributes.RegenerationAttribute
The custom regeneration attribute to control the regeneration behavior of the external command or external application.
Since: 2011